
#include "rcc.h"
#include "gpio.h"


int main()
{
    //Включаем тактирование GPIO I порта, порт номер 8 (очень важно)
    RCC->AHB1ENR |= (1<<8);

    //Структура для обращения к регистрам порта
    //Используем офсет умноженый на номер порта что дает нам адресс порта
    //В дальнейшем нам такой подход очень пригодится
    volatile GPIO_Struct *GPIOI = (GPIO_Struct *)(GPIO_BASE + (GPIO_OFFSET*8));  

    //Далее настраиваем режим ножки на "Выход"
    GPIOI->MODER |= (1<<2);

    //Теперь указываем тип выхода, в данном примере, push-pull, необходимости указывать нет.
    //По умолчанию стоит push pull
    GPIOI->OTYPER &= ~(1<<1);

    //Скорость с которой будет происходить переключение ножки, очень важный парметр при работе с переферией
    GPIOI->OSPEEDR |= (2<<2);

    //И теперь наш цикл
    while(1){
        for(volatile int i = 0; i < 1000000; i++){
            // Задержка на 1 миллион циклов
        }

        //Перпеключаем светодиод, если был ноль то будет 0 и наоброт.
        GPIOI->ODR ^= (1<<1);
    }

    return 0;
}